# -*- coding: cp936 -*-
dict={"石杰":'10505450',
      "陈悦":'773552385',
      "杨建":'451146633',
      "赵思敏":'793876708',
      "顾珣":'864325952',
      "简燕敏":'271080405',
      "康伟":"372953481",
      "石亚芹":"346364892",
      "王健琴":"465618148",
      "张慧":"250171411",
      "张勇":'79654994',
      "周婷":'744612884',
      "朱垒":'747351208',
      "曹娟":'947385585',
      "冯磊":'1179941700',
      "高鹏飞":'463593804',
      "何全仁":"546916772",
      "胡涛":"475835892",
      "吉姗":'562243985',
      "寇晓翠":'82894614',
      "罗爽爽":'634711351',
      "舒晓云":"182489501",
      "陶杰":'601256750',
      "王娟":'395467943',
      "吴飞":'285694450',
      "严金勇":'372268297',
      "严俊杰":'475771267',
      "叶凌燕":'188400130'
      }
def qqemail(name):
    li=[]
    name=name.lower()
    if not dict.has_key(name):
        return False
    if 'all' == name:
        for i in dict.values():
            li.append(i+"@qq.com")
    elif 'boss' == name:
        li.append(dict["石杰"]+"@qq.com")
    elif 'tl' == name:
        for i in ['陈悦',"寇晓翠","张勇","胡涛","杨建"]:
            li.append(dict[i]+"@qq.com")
    elif 'wifitl' == name:
        for i in ['陈悦',"寇晓翠","胡涛"]:
            li.append(dict[i]+"@qq.com")
    elif 'inttl' == name:
        for i in ["张勇","杨建"]:
            li.append(dict[i]+"@qq.com")
    else :
        li.append(dict[name]+"@qq.com")
    return li
if __name__=='__main__':
    print qqemail("inttl")
